# IsReadOnly Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
APIObject..::..IsReadOnly Property
APIObject Class Example See Also
---
Identifies if the object is read-only or modifiable.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public virtual bool IsReadOnly { get; }
```

Visual Basic
---
```text
Public Overridable ReadOnly Property IsReadOnly As Boolean
	Get
```

Visual C++
---
```text
public:
virtual property bool IsReadOnly {
	bool get ();
}
```

# ### Field Value
If true, the object may not be modified. If false, the object's contents may be modified.
# Examples
CopyC#
```text
Document project = uiApplication.ActiveUIDocument.Document;
Settings settings = project.Settings;
TaskDialog.Show("Revit","Categories: " + settings.Categories.IsReadOnly.ToString());
```

CopyVB.NET
```text
Dim project As Document = uiApplication.ActiveUIDocument.Document
Dim settings As Settings = project.Settings
TaskDialog.Show("Revit", "Categories: " + settings.Categories.IsReadOnly.ToString())
```

# See Also
APIObject Class
Autodesk.Revit.DB Namespace